surfaceMountedCube/fullCaseDMD/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            false;
addLayers       false;

geometry
{
    cube
    {
        type            searchableBox;
        min             (3.5 4 0);
        max             (4.5 5 1);
    }
}


castellatedMeshControls
{
    maxLocalCells       100000;
    maxGlobalCells      100000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 1;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;
    features
    ();
    refinementSurfaces
    {
        cube
        {
            level (0 0);
            patchInfo
            {
                type     empty;
                inGroups (allPatches);
            }
        }
    };
    refinementRegions{};
    locationInMesh (8 4 1);
}


snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      100;
    nRelaxIter      5;
}


addLayersControls
{}


meshQualityControls
{
    #includeEtc "caseDicts/meshQualityDict"
}

debug 0;
mergeTolerance 1e-6;


// ************************************************************************* //
